{
  "remix": {
    "created": "November 22, 2021",
    "description": "Remix is a React framework for building full-stack web applications. Remix is primarily focused on SSR, providing fast initial page load and SEO benefits",
    "icon": "remix-icon.svg",
    "related": ["Webpack"]
  },
  "vite": {
    "created": "April 20, 2020",
    "description": "Vite is a build tool that aims to provide a faster and leaner development experience for modern web projects. It consists of two major parts:",
    "icon": "vite-logo.svg",
    "related": ["Webpack"]
  },
  "wasm": {
    "created": "March 2017",
    "description": "WebAssembly (abbreviated Wasm) is a binary instruction format for a stack-based virtual machine. Wasm is designed as a portable compilation target for programming languages, enabling deployment on the web for client and server applications.",
    "icon": "wasm-logo.svg",
    "related": ["React"]
  },
  "next.js": {
    "created": "October 25, 2016",
    "description": "Next.js is a React framework for building full-stack web applications. You use React Components to build user interfaces, and Next.js for additional features and optimizations.",
    "icon": "next-js-icon.png",
    "related": ["React"]
  },
  "react-native": {
    "created": "March 26, 2015",
    "description": "React-Native is Mobile UI framework. with React Native, you can create truly native apps without compromising the user experience.",
    "icon": "react-native-icon.svg",
    "related": ["React", "Javascript"]
  },
  "webpack": {
    "created": "February 19, 2014",
    "description": "At its core, webpack is a static module bundler for modern JavaScript applications. When webpack processes your application, it internally builds a dependency graph from one or more entry points and then combines every module your project needs into one or more bundles, which are static assets to serve your content from.",
    "icon": "webpack-icon.png",
    "related": ["HTML", "Javascript"]
  },
  "react": {
    "created": "May 29, 2013",
    "description": "Facebook faced a number of challenges, including complex UI state management, performance limitations for efficient UI updates and rendering, and difficult code reuse and code maintenance due to a large and complex codebase. This led to the reemergence of SPA, which had been around since the early 2000s. (SPAs hadn't gotten much attention at the time because user experience wasn't a high priority). In 2013, React came along and With its virtual DOM, component-based design, one-way data flow, JSX syntax, and many other benefits, the technology quickly became a favorite among developers. \n React lets you build user interfaces out of individual pieces called components. Create your own React components like Thumbnail, LikeButton, and Video. Then combine them into entire screens, pages, and apps.",
    "icon": "react-icon.webp",
    "related": ["HTML", "Javascript"]
  },
  "typescirpt": {
    "created": "October 1, 2012",
    "description": "Typescript adds extra syntax to JavaScript to catch errors early in the editor. After that, it's converted to JavaScript in the browser, Node.js or Deno, and your app.",
    "icon": "typescript-icon.svg",
    "related": ["Javascript"]
  }
}
